/*
 * mlc_timer.c
 *
 *  Created on: 2015/07/20
 *      Author: yohji
 */

#include <chip.h>
#include "board.h"
#include "mlc_config.h"

/*--------------------------------------------------------------------------------------------------
 * Macros
 ---------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------
 * Struct
 ---------------------------------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------------------------------
 * Lable
 ---------------------------------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------------------------------
 * Globals
 ---------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------
 * 割り込みハンドラ
 ---------------------------------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------------------------------
 * 通常Function
 ---------------------------------------------------------------------------------------------------*/
/* @fn
 * 16bitコンペアマッチタイマ初期化
 * @breaf Matrix LED ClockのLEDの点灯ON/OFFの制御を行う(下側)
 * @param lineNum		：	ライン番号(0～8、16～24)
 * @param colorDepth	：	色情報の深さ(クロック数)
 * @return なし
 * @sa なし
 * @detail なし
 */
void cmt_timer16_init(uint32_t timer_num)
{

	if (0 == timer_num) {
		/* タイマ初期化 */
		Chip_TIMER_Init(LPC_TIMER16_0);
		/* すでに実施済みのためコメントアウト */
//		Chip_IOCON_PinMux(LPC_IOCON, IOCON_PIO0_2, IOCON_MODE_PULLUP, IOCON_FUNC2);			/* Pin設定 */
		/* カウント制御レジスタ（CTCR） タイマモードまたはカウンタモードを選択 */
		Chip_TIMER_TIMER_SetCountClockSrc( LPC_TIMER16_0, TIMER_CAPSRC_RISING_PCLK, 0 );	/* カウンタモード */

//		Chip_TIMER_CaptureFallingEdgeEnable( LPC_TIMER16_0, 0 );   // set falling edge
//		Chip_TIMER_CaptureEnableInt( LPC_TIMER16_0, 0 );  // set interrupt for pio0_2

		/* プリスケールレジスタ[PR]。PC = PRとなった場合、TCが1インクリメント */
		Chip_TIMER_PrescaleSet( LPC_TIMER16_0, 12000 );   // prescaler 48000, milliseconds

		/* マッチレジスタ[MR0/1/2/3] TC = MRとなった場合に、MCRの設定よって割り込み等を発生 */
		Chip_TIMER_SetMatch(LPC_TIMER16_0, 0, 8);

		/* マッチ制御レジスタ[MCR] マッチ制御レジスタを使用して、マッチレジスタの 1 つがタイマカウンタと一致したときに実行する動作を制御 */
		Chip_TIMER_MatchEnableInt(LPC_TIMER16_0, 0);		/* MR0 が TC の値と一致した場合に、割り込みを生成 */
		Chip_TIMER_ResetOnMatchEnable(LPC_TIMER16_0, 0);	/* MR0 が TC と一致した場合に、TC をリセット */

		/* 割り込みまたは例外の保留中ステータスを 0 にクリア */
		NVIC_ClearPendingIRQ(TIMER_16_0_IRQn);				/* 割り込みクリア */
		NVIC_EnableIRQ(TIMER_16_0_IRQn);                    /* enable interrupt */

		/* -------------- タイマ開始 -------------- */
		Chip_TIMER_Enable(LPC_TIMER16_0);
	}
	return ;
}

